In [1]:
#%pip install ipython
#%pip install seaborn

### importación de librerías

In [2]:
# importación de librerías
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# para pintar
import pylab as plt
import seaborn as sns

#para que salga el grafico
%matplotlib inline

### limpieza csv actor

In [4]:
# importación de csv
df_act_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\actor.csv')

In [5]:
df_act_ori.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [6]:
# copia del df original
df_act=df_act_ori.copy()

In [7]:
df_act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [8]:
df_act.shape

(200, 4)

In [9]:
df_act_dim_orig=df_act.shape

In [10]:
# info del df
df_act.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [11]:
nan_cols=df_act.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [12]:
df_act.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
actor_id,200.0,NaN,NaN,NaN,100.5,57.879185,1.0,50.75,100.5,150.25,200.0
first_name,200,128,PENELOPE,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_name,200,121,KILMER,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_update,200,1,2006-02-15 04:34:33,200,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df_act.drop_duplicates().shape==df_act.shape

True

In [14]:
# exploración columna 'actor_id'
df_act.actor_id.head()

0    1
1    2
2    3
3    4
4    5
Name: actor_id, dtype: int64

In [15]:
df_act.actor_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200], dtype=int64)

In [16]:
df_act.actor_id.value_counts().head()

1      1
138    1
128    1
129    1
130    1
Name: actor_id, dtype: int64

In [17]:
len(df_act.actor_id.value_counts())

200

In [18]:
df_act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [19]:
# exploración y limpieza de columnas del df 
len(df_act.first_name.unique())

128

In [20]:
df_act.first_name.value_counts().head()

PENELOPE    4
JULIA       4
KENNETH     4
GENE        3
GROUCHO     3
Name: first_name, dtype: int64

In [21]:
len(df_act.last_name.unique())

121

In [22]:
df_act.last_name.value_counts().head()

KILMER     5
TEMPLE     4
NOLTE      4
GUINESS    3
ALLEN      3
Name: last_name, dtype: int64

In [23]:
df_act.drop_duplicates(subset = ['first_name','last_name']).shape==df_act.shape

False

In [24]:
df_act['complete_name'] = df_act.first_name + (' ') + df_act.last_name

In [25]:
df_act['complete_name'].head()

0       PENELOPE GUINESS
1          NICK WAHLBERG
2               ED CHASE
3         JENNIFER DAVIS
4    JOHNNY LOLLOBRIGIDA
Name: complete_name, dtype: object

In [26]:
df_act['complete_name'].value_counts().head()

SUSAN DAVIS       2
EWAN GOODING      1
DARYL CRAWFORD    1
GRETA KEITEL      1
JANE JACKMAN      1
Name: complete_name, dtype: int64

In [27]:
df_act[df_act.complete_name == 'SUSAN DAVIS'] # se identifica una actriz repetida. Sólo es 1, de momento la dejamos y no borramos.

     actor_id first_name last_name          last_update complete_name
100       101      SUSAN     DAVIS  2006-02-15 04:34:33   SUSAN DAVIS
109       110      SUSAN     DAVIS  2006-02-15 04:34:33   SUSAN DAVIS

In [28]:
df_act.last_update.value_counts() # la columna 'last_update' no aporta info, la borramos.

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [29]:
df_act.drop(['last_update'], axis=1, inplace = True)

In [30]:
df_act.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

### limpieza csv category

In [31]:
df_cat_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\category.csv')

In [32]:
df_cat_ori.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [33]:
# copia del df original
df_cat=df_cat_ori.copy()

In [34]:
df_cat.shape

(16, 3)

In [35]:
df_cat_dim_orig=df_cat.shape

In [36]:
# info del df
df_cat.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [37]:
df_cat.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [38]:
df_cat.drop_duplicates().shape==df_cat.shape

True

In [39]:
# exploración y limpieza de columnas del df 
df_cat.category_id.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16],
      dtype=int64)

In [40]:
df_cat.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

In [41]:
df_cat.name.value_counts()

Action         1
Animation      1
Children       1
Classics       1
Comedy         1
Documentary    1
Drama          1
Family         1
Foreign        1
Games          1
Horror         1
Music          1
New            1
Sci-Fi         1
Sports         1
Travel         1
Name: name, dtype: int64

In [42]:
df_cat.last_update.unique()

array(['2006-02-15 04:46:27'], dtype=object)

In [43]:
df_cat.drop(['last_update'], axis=1, inplace = True)

In [44]:
df_cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

### limpieza csv film

In [45]:
# importación de csv
df_film_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\film.csv')

In [46]:
df_film_ori.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [47]:
df_film=df_film_ori.copy()

In [48]:
df_film.shape

(1000, 13)

In [49]:
df_film_dim_orig=df_film.shape

In [50]:
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [51]:
df_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [52]:
df_film.drop_duplicates().shape==df_film.shape

True

In [53]:
df_film.film_id.head()

0    1
1    2
2    3
3    4
4    5
Name: film_id, dtype: int64

In [57]:
df_film.film_id.unique()

array([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,
         12,   13,   14,   15,   16,   17,   18,   19,   20,   21,   22,
         23,   24,   25,   26,   27,   28,   29,   30,   31,   32,   33,
         34,   35,   36,   37,   38,   39,   40,   41,   42,   43,   44,
         45,   46,   47,   48,   49,   50,   51,   52,   53,   54,   55,
         56,   57,   58,   59,   60,   61,   62,   63,   64,   65,   66,
         67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,
         78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,
         89,   90,   91,   92,   93,   94,   95,   96,   97,   98,   99,
        100,  101,  102,  103,  104,  105,  106,  107,  108,  109,  110,
        111,  112,  113,  114,  115,  116,  117,  118,  119,  120,  121,
        122,  123,  124,  125,  126,  127,  128,  129,  130,  131,  132,
        133,  134,  135,  136,  137,  138,  139,  140,  141,  142,  143,
        144,  145,  146,  147,  148,  149,  150,  151,  152,  153,  154,
        155,  156,  157,  158,  159,  160,  161,  162,  163,  164,  165,
        166,  167,  168,  169,  170,  171,  172,  173,  174,  175,  176,
        177,  178,  179,  180,  181,  182,  183,  184,  185,  186,  187,
        188,  189,  190,  191,  192,  193,  194,  195,  196,  197,  198,
        199,  200,  201,  202,  203,  204,  205,  206,  207,  208,  209,
        210,  211,  212,  213,  214,  215,  216,  217,  218,  219,  220,
        221,  222,  223,  224,  225,  226,  227,  228,  229,  230,  231,
        232,  233,  234,  235,  236,  237,  238,  239,  240,  241,  242,
        243,  244,  245,  246,  247,  248,  249,  250,  251,  252,  253,
        254,  255,  256,  257,  258,  259,  260,  261,  262,  263,  264,
        265,  266,  267,  268,  269,  270,  271,  272,  273,  274,  275,
        276,  277,  278,  279,  280,  281,  282,  283,  284,  285,  286,
        287,  288,  289,  290,  291,  292,  293,  294,  295,  296,  297,
        298,  299,  300,  301,  302,  303,  304,  305,  306,  307,  308,
        309,  310,  311,  312,  313,  314,  315,  316,  317,  318,  319,
        320,  321,  322,  323,  324,  325,  326,  327,  328,  329,  330,
        331,  332,  333,  334,  335,  336,  337,  338,  339,  340,  341,
        342,  343,  344,  345,  346,  347,  348,  349,  350,  351,  352,
        353,  354,  355,  356,  357,  358,  359,  360,  361,  362,  363,
        364,  365,  366,  367,  368,  369,  370,  371,  372,  373,  374,
        375,  376,  377,  378,  379,  380,  381,  382,  383,  384,  385,
        386,  387,  388,  389,  390,  391,  392,  393,  394,  395,  396,
        397,  398,  399,  400,  401,  402,  403,  404,  405,  406,  407,
        408,  409,  410,  411,  412,  413,  414,  415,  416,  417,  418,
        419,  420,  421,  422,  423,  424,  425,  426,  427,  428,  429,
        430,  431,  432,  433,  434,  435,  436,  437,  438,  439,  440,
        441,  442,  443,  444,  445,  446,  447,  448,  449,  450,  451,
        452,  453,  454,  455,  456,  457,  458,  459,  460,  461,  462,
        463,  464,  465,  466,  467,  468,  469,  470,  471,  472,  473,
        474,  475,  476,  477,  478,  479,  480,  481,  482,  483,  484,
        485,  486,  487,  488,  489,  490,  491,  492,  493,  494,  495,
        496,  497,  498,  499,  500,  501,  502,  503,  504,  505,  506,
        507,  508,  509,  510,  511,  512,  513,  514,  515,  516,  517,
        518,  519,  520,  521,  522,  523,  524,  525,  526,  527,  528,
        529,  530,  531,  532,  533,  534,  535,  536,  537,  538,  539,
        540,  541,  542,  543,  544,  545,  546,  547,  548,  549,  550,
        551,  552,  553,  554,  555,  556,  557,  558,  559,  560,  561,
        562,  563,  564,  565,  566,  567,  568,  569,  570,  571,  572,
        573,  574,  575,  576,  577,  578,  579,  580,  581,  582,  583,
        584,  585,  586,  587,  588,  589,  590,  591,  592,  593,  594,
        595,  596,  597,  598,  599,  600,  601,  602,  603,  604,  605,
        606,  607,  608,  609,  610,  611,  612,  613,  614,  615,  616,
        617,  618,  619,  620,  621,  622,  623,  624,  625,  626,  627,
        628,  629,  630,  631,  632,  633,  634,  635,  636,  637,  638,
        639,  640,  641,  642,  643,  644,  645,  646,  647,  648,  649,
        650,  651,  652,  653,  654,  655,  656,  657,  658,  659,  660,
        661,  662,  663,  664,  665,  666,  667,  668,  669,  670,  671,
        672,  673,  674,  675,  676,  677,  678,  679,  680,  681,  682,
        683,  684,  685,  686,  687,  688,  689,  690,  691,  692,  693,
        694,  695,  696,  697,  698,  699,  700,  701,  702,  703,  704,
        705,  706,  707,  708,  709,  710,  711,  712,  713,  714,  715,
        716,  717,  718,  719,  720,  721,  722,  723,  724,  725,  726,
        727,  728,  729,  730,  731,  732,  733,  734,  735,  736,  737,
        738,  739,  740,  741,  742,  743,  744,  745,  746,  747,  748,
        749,  750,  751,  752,  753,  754,  755,  756,  757,  758,  759,
        760,  761,  762,  763,  764,  765,  766,  767,  768,  769,  770,
        771,  772,  773,  774,  775,  776,  777,  778,  779,  780,  781,
        782,  783,  784,  785,  786,  787,  788,  789,  790,  791,  792,
        793,  794,  795,  796,  797,  798,  799,  800,  801,  802,  803,
        804,  805,  806,  807,  808,  809,  810,  811,  812,  813,  814,
        815,  816,  817,  818,  819,  820,  821,  822,  823,  824,  825,
        826,  827,  828,  829,  830,  831,  832,  833,  834,  835,  836,
        837,  838,  839,  840,  841,  842,  843,  844,  845,  846,  847,
        848,  849,  850,  851,  852,  853,  854,  855,  856,  857,  858,
        859,  860,  861,  862,  863,  864,  865,  866,  867,  868,  869,
        870,  871,  872,  873,  874,  875,  876,  877,  878,  879,  880,
        881,  882,  883,  884,  885,  886,  887,  888,  889,  890,  891,
        892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000],
      dtype=int64)

In [58]:
len(df_film.film_id.unique())

1000

In [59]:
df_film.film_id.value_counts().head()

1      1
672    1
659    1
660    1
661    1
Name: film_id, dtype: int64

In [60]:
df_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [61]:
df_film.title.head()

0    ACADEMY DINOSAUR
1      ACE GOLDFINGER
2    ADAPTATION HOLES
3    AFFAIR PREJUDICE
4         AFRICAN EGG
Name: title, dtype: object

In [64]:
#df_film.title.unique()

In [65]:
df_film.title.value_counts().head()

ACADEMY DINOSAUR    1
PERFECT GROOVE      1
PARK CITIZEN        1
PARTY KNOCK         1
PAST SUICIDES       1
Name: title, dtype: int64

In [66]:
len(df_film.title.value_counts())

1000

In [67]:
df_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [68]:
df_film.description.head()

0    A Epic Drama of a Feminist And a Mad Scientist...
1    A Astounding Epistle of a Database Administrat...
2    A Astounding Reflection of a Lumberjack And a ...
3    A Fanciful Documentary of a Frisbee And a Lumb...
4    A Fast-Paced Documentary of a Pastry Chef And ...
Name: description, dtype: object

In [71]:
#df_film.description.unique()

In [72]:
df_film.description.value_counts().head()

A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies                   1
A Thrilling Yarn of a Dog And a Dog who must Build a Husband in A Baloon                                           1
A Taut Epistle of a Sumo Wrestler And a Girl who must Face a Husband in Ancient Japan                              1
A Fateful Display of a Technical Writer And a Butler who must Battle a Sumo Wrestler in An Abandoned Mine Shaft    1
A Intrepid Tale of a Madman And a Astronaut who must Challenge a Hunter in A Monastery                             1
Name: description, dtype: int64

In [73]:
df_film.release_year.head()

0    2006
1    2006
2    2006
3    2006
4    2006
Name: release_year, dtype: int64

In [74]:
df_film.drop(['release_year'], axis=1, inplace = True)

In [75]:
df_film.columns

Index(['film_id', 'title', 'description', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [76]:
df_film.language_id.head()

0    1
1    1
2    1
3    1
4    1
Name: language_id, dtype: int64

In [77]:
df_film.language_id.unique()

array([1], dtype=int64)

In [78]:
df_film.language_id.value_counts()

1    1000
Name: language_id, dtype: int64

In [79]:
df_film.head()

,film_id,title,description,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [80]:
df_film.original_language_id.unique()

array([nan])

In [81]:
df_film.drop(['original_language_id'], axis=1, inplace = True)

In [82]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [83]:
df_film.rental_duration.unique()

array([6, 3, 7, 5, 4], dtype=int64)

In [84]:
df_film.rental_duration.value_counts()

6    212
3    203
4    203
7    191
5    191
Name: rental_duration, dtype: int64

In [85]:
df_film.length.unique()

array([ 86,  48,  50, 117, 130, 169,  62,  54, 114,  63, 126, 136, 150,
        94,  46, 180,  82,  57, 113,  79, 129,  85,  92, 181,  74, 179,
        91, 168, 119, 153, 147, 127, 121,  68,  99, 148, 137, 170,  83,
       108, 118, 162, 182,  75, 173,  87,  65,  90, 122, 160,  89, 175,
       106,  73, 151, 100,  53,  77, 142,  93, 163, 103,  61,  71, 102,
        76,  98,  72, 176, 123,  56, 161,  60, 133, 125,  67,  52, 120,
       167,  70, 135, 112, 183, 110, 152,  51, 146,  66, 185, 124, 107,
       101, 132, 143, 165,  81, 164,  58,  95, 139,  55, 149, 109,  59,
       172, 115, 184, 166,  64, 104,  69,  84, 144,  88, 141,  47,  49,
       177, 154, 159, 178,  96, 116, 171, 140, 155, 158, 174, 138,  97,
       131, 156,  80, 145, 111, 128, 157,  78, 105, 134], dtype=int64)

In [86]:
df_film.length.value_counts().head()

85     17
179    13
112    13
84     13
73     12
Name: length, dtype: int64

In [87]:
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
 10  last_update       1000 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 479.7 KB

In [88]:
df_film.replacement_cost.unique()

array([20.99, 12.99, 18.99, 26.99, 22.99, 17.99, 28.99, 15.99, 21.99,
       24.99, 16.99, 23.99, 10.99, 14.99, 27.99,  9.99, 19.99, 11.99,
       29.99, 25.99, 13.99])

In [89]:
df_film.replacement_cost.value_counts().head()

20.99    57
22.99    55
12.99    55
21.99    55
13.99    55
Name: replacement_cost, dtype: int64

In [90]:
df_film.rating.unique()

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)

In [91]:
df_film.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [92]:
df_film.special_features.unique()

array(['Deleted Scenes,Behind the Scenes', 'Trailers,Deleted Scenes',
       'Commentaries,Behind the Scenes', 'Deleted Scenes', 'Trailers',
       'Commentaries,Deleted Scenes',
       'Trailers,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Behind the Scenes', 'Trailers,Commentaries',
       'Trailers,Behind the Scenes',
       'Commentaries,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Deleted Scenes',
       'Trailers,Commentaries,Deleted Scenes,Behind the Scenes',
       'Behind the Scenes', 'Commentaries'], dtype=object)

In [93]:
df_film.special_features.value_counts()

Trailers,Commentaries,Behind the Scenes                   79
Trailers                                                  72
Trailers,Commentaries                                     72
Trailers,Behind the Scenes                                72
Deleted Scenes,Behind the Scenes                          71
Commentaries,Behind the Scenes                            70
Behind the Scenes                                         70
Trailers,Deleted Scenes                                   66
Commentaries,Deleted Scenes,Behind the Scenes             66
Commentaries,Deleted Scenes                               65
Trailers,Commentaries,Deleted Scenes                      64
Commentaries                                              62
Deleted Scenes                                            61
Trailers,Commentaries,Deleted Scenes,Behind the Scenes    61
Trailers,Deleted Scenes,Behind the Scenes                 49
Name: special_features, dtype: int64

In [94]:
df_film.last_update.unique()

array(['2006-02-15 05:03:42'], dtype=object)

In [95]:
df_film.drop(['last_update'], axis=1, inplace = True)

In [96]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

### limpieza csv inventory

In [97]:
df_inv_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\inventory.csv')

In [98]:
df_inv_ori.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [99]:
df_inv=df_inv_ori.copy()

In [100]:
df_inv.shape

(1000, 4)

In [101]:
df_finv_dim_orig=df_inv.shape

In [102]:
df_inv.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [131]:
df_inv.drop_duplicates().shape==df_inv.shape

True

In [103]:
df_inv.inventory_id.value_counts().head()

1      1
672    1
659    1
660    1
661    1
Name: inventory_id, dtype: int64

In [104]:
len(df_inv.inventory_id.value_counts())

1000

In [105]:
df_inv.film_id.value_counts().head()

1      8
127    8
73     8
174    8
86     8
Name: film_id, dtype: int64

In [106]:
df_inv.store_id.value_counts()

1    503
2    497
Name: store_id, dtype: int64

In [107]:
df_inv.last_update.value_counts()

2006-02-15 05:09:17    1000
Name: last_update, dtype: int64

In [108]:
df_inv.drop(['last_update'], axis=1, inplace = True)

In [109]:
df_inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

### limpieza csv language

In [110]:
df_lang_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\language.csv')

In [111]:
df_lang_ori

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [112]:
df_lang=df_lang_ori.copy()

In [113]:
df_lang.shape

(6, 3)

In [114]:
df_lang_dim_orig=df_lang.shape

In [115]:
df_lang.drop(['last_update'], axis=1, inplace = True)

In [116]:
df_lang_ori

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

### limpieza csv rental

In [117]:
df_ren_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\rental.csv')

In [118]:
df_ren_ori.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [119]:
df_ren=df_ren_ori.copy()

In [120]:
df_ren.shape

(1000, 7)

In [121]:
df_ren_dim_orig=df_ren.shape

In [122]:
df_ren.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [123]:
df_ren.drop_duplicates().shape==df_ren.shape

True

In [124]:
df_ren.rental_id.value_counts().head()

1      1
673    1
660    1
661    1
662    1
Name: rental_id, dtype: int64

In [125]:
df_ren.rental_date.value_counts().head()

2005-05-30 14:47:31    2
2005-05-28 22:07:30    1
2005-05-28 20:53:31    1
2005-05-28 21:01:25    1
2005-05-28 21:09:31    1
Name: rental_date, dtype: int64

In [126]:
df_ren.inventory_id.value_counts().head()

367     1
1769    1
1414    1
2247    1
2968    1
Name: inventory_id, dtype: int64

In [127]:
df_ren.customer_id.value_counts().head()

197    8
245    6
596    6
274    6
371    6
Name: customer_id, dtype: int64

In [128]:
df_ren.return_date.value_counts().head()

2005-06-05 15:16:54    2
2005-06-03 06:05:10    2
2005-06-06 06:23:00    2
2005-05-26 22:04:30    1
2005-05-30 15:26:31    1
Name: return_date, dtype: int64

In [129]:
df_ren.staff_id.value_counts()

2    521
1    479
Name: staff_id, dtype: int64

In [130]:
df_ren.last_update.value_counts()

2006-02-15 21:30:53    1000
Name: last_update, dtype: int64

In [131]:
df_ren.drop(['last_update'], axis=1, inplace = True)

In [132]:
df_ren.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

### limpieza csv old_HDD

In [133]:
df_old_ori = pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data\old_HDD.csv')

In [134]:
df_old_ori.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [135]:
df_old=df_old_ori.copy()

In [136]:
df_old.shape

(1000, 5)

In [137]:
df_old_dim_orig=df_old.shape

In [138]:
df_old.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [139]:
df_old.drop_duplicates().shape==df_old.shape

True

In [140]:
df_old.first_name.unique()

array(['PENELOPE', 'NICK', 'ED', 'JENNIFER', 'JOHNNY', 'BETTE', 'GRACE',
       'MATTHEW', 'JOE', 'CHRISTIAN', 'ZERO', 'KARL', 'UMA', 'VIVIEN',
       'CUBA', 'FRED', 'HELEN', 'DAN', 'BOB', 'LUCILLE', 'KIRSTEN',
       'ELVIS', 'SANDRA', 'CAMERON', 'KEVIN', 'RIP', 'JULIA', 'WOODY',
       'ALEC', 'SISSY', 'TIM', 'MILLA', 'AUDREY', 'JUDY', 'BURT', 'VAL',
       'TOM', 'GOLDIE'], dtype=object)

In [143]:
df_old.first_name.value_counts()

SANDRA       56
VAL          35
UMA          35
JULIA        33
RIP          33
HELEN        32
KARL         31
WOODY        31
VIVIEN       30
LUCILLE      30
GRACE        30
JOHNNY       29
BURT         29
ALEC         29
CUBA         28
KIRSTEN      27
FRED         27
ELVIS        26
ZERO         25
BOB          25
NICK         25
AUDREY       25
JOE          25
TOM          25
MILLA        24
CAMERON      24
TIM          23
DAN          22
ED           22
JENNIFER     22
CHRISTIAN    22
KEVIN        21
MATTHEW      20
BETTE        20
PENELOPE     19
SISSY        18
JUDY         15
GOLDIE        7
Name: first_name, dtype: int64

In [144]:
df_old.last_name.unique()

array(['GUINESS', 'WAHLBERG', 'CHASE', 'DAVIS', 'LOLLOBRIGIDA',
       'NICHOLSON', 'MOSTEL', 'JOHANSSON', 'SWANK', 'GABLE', 'CAGE',
       'BERRY', 'WOOD', 'BERGEN', 'OLIVIER', 'COSTNER', 'VOIGHT', 'TORN',
       'FAWCETT', 'TRACY', 'PALTROW', 'MARX', 'KILMER', 'STREEP', 'BLOOM',
       'CRAWFORD', 'MCQUEEN', 'HOFFMAN', 'WAYNE', 'PECK', 'SOBIESKI',
       'HACKMAN', 'DEAN', 'DUKAKIS', 'BOLGER', 'MCKELLEN', 'BRODY'],
      dtype=object)

In [145]:
df_old.last_name.value_counts()

OLIVIER         53
PECK            43
KILMER          37
BOLGER          35
WOOD            35
MCQUEEN         33
CRAWFORD        33
VOIGHT          32
BERRY           31
HOFFMAN         31
BERGEN          30
MOSTEL          30
TRACY           30
WAYNE           29
DUKAKIS         29
LOLLOBRIGIDA    29
PALTROW         27
COSTNER         27
MARX            26
MCKELLEN        25
SWANK           25
WAHLBERG        25
CAGE            25
FAWCETT         25
STREEP          24
HACKMAN         23
GABLE           22
DAVIS           22
TORN            22
CHASE           22
BLOOM           21
NICHOLSON       20
JOHANSSON       20
GUINESS         19
SOBIESKI        18
DEAN            15
BRODY            7
Name: last_name, dtype: int64

In [146]:
df_old.drop_duplicates(subset = ['first_name', 'title', 'last_name']).shape==df_old.shape

True

In [147]:
df_old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [148]:
#df_old.title.unique()

In [149]:
len(df_old.title.unique())

614

In [150]:
len(df_film.title.unique())

1000

In [151]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [152]:
lst = []

for i in range (len(df_old)):
    for j in range (len(df_film)):
        if df_old.loc[i, 'title'] == df_film.loc[j, 'title']:
            lst.append(df_film.loc[j, 'film_id'])
            break
            
lst[:10]

[1, 23, 25, 106, 140, 166, 277, 361, 438, 499]

In [153]:
len(df_old)

1000

In [154]:
len(lst)

1000

In [155]:
df_old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [156]:
df_old['film_id'] = lst

In [157]:
df_old.head()

,first_name,last_name,title,release_year,category_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140

In [158]:
df_old.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [159]:
df_old.category_id.value_counts()

15    79
1     77
2     75
7     74
13    73
6     72
11    64
9     64
3     62
14    58
8     57
4     55
12    54
16    52
5     46
10    38
Name: category_id, dtype: int64

In [160]:
df_old.head()

,first_name,last_name,title,release_year,category_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140

In [161]:
df_act.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [162]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [163]:
df_cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [164]:
df_old['complete_name'] = df_old.first_name + ' ' + df_old.last_name

In [165]:
df_old.head()

,first_name,last_name,title,release_year,category_id,film_id,complete_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140,PENELOPE GUINESS

In [166]:
len(df_old)

1000

In [167]:
df_act.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [168]:
len(df_act)

200

In [169]:
lst1 = []

for i in range (len(df_old)):
    for j in range (len(df_act)):
        if df_old.loc[i, 'complete_name'] == df_act.loc[j, 'complete_name']:
            lst1.append(df_act.loc[j, 'actor_id'])
            break
            
lst1[:10]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

In [170]:
df_old['actor_id'] = lst1

In [171]:
df_old.head()

,first_name,last_name,title,release_year,category_id,film_id,complete_name,actor_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,PENELOPE GUINESS,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23,PENELOPE GUINESS,1
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25,PENELOPE GUINESS,1
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106,PENELOPE GUINESS,1
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140,PENELOPE GUINESS,1

### Revisión de columnas similares en los diferentes df

In [173]:
#df_film.film_id.unique()

In [174]:
df_inv.film_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223],
      dtype=int64)

In [175]:
#df_inv.inventory_id.unique()

In [176]:
df_inv.inventory_id.value_counts().head()

1      1
672    1
659    1
660    1
661    1
Name: inventory_id, dtype: int64

In [177]:
len(df_inv.inventory_id.unique())

1000

In [178]:
len(df_ren.inventory_id.unique())

1000

In [179]:
#df_ren.inventory_id.unique()

In [180]:
df_ren.inventory_id.value_counts().head()

367     1
1769    1
1414    1
2247    1
2968    1
Name: inventory_id, dtype: int64

In [181]:
#df_film.film_id.unique()

In [182]:
#df_old.film_id.unique()

In [183]:
df_old.film_id.value_counts().head()

87     6
321    5
853    5
635    5
146    5
Name: film_id, dtype: int64

In [184]:
len(df_old.film_id.value_counts())

614

In [185]:
df_old[df_old.film_id == 87]

,first_name,last_name,title,release_year,category_id,film_id,complete_name,actor_id
47,ED,CHASE,BOONDOCK BALLROOM,2006,16,87,ED CHASE,3
71,JENNIFER,DAVIS,BOONDOCK BALLROOM,2006,16,87,JENNIFER DAVIS,4
293,UMA,WOOD,BOONDOCK BALLROOM,2006,16,87,UMA WOOD,13
384,FRED,COSTNER,BOONDOCK BALLROOM,2006,16,87,FRED COSTNER,16
520,KIRSTEN,PALTROW,BOONDOCK BALLROOM,2006,16,87,KIRSTEN PALTROW,21
785,SANDRA,PECK,BOONDOCK BALLROOM,2006,16,87,SANDRA PECK,30

In [186]:
df_old.drop_duplicates().shape==df_old.shape

True

In [187]:
df_old.actor_id.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39], dtype=int64)

In [188]:
df_act.actor_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200], dtype=int64)

In [189]:
len(df_ren.inventory_id[df_ren.inventory_id < 1000])

212

In [190]:
df_old[df_old.complete_name == 'SUSAN DAVIS']

Empty DataFrame
Columns: [first_name, last_name, title, release_year, category_id, film_id, complete_name, actor_id]
Index: []

In [191]:
df_old[df_old.actor_id == 110]

Empty DataFrame
Columns: [first_name, last_name, title, release_year, category_id, film_id, complete_name, actor_id]
Index: []

In [192]:
df_act.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [193]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [194]:
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [195]:
max_len=0

for i in df_film.special_features:
    if len(i) > max_len:
        max_len = len(i)
        
max_len

54

In [196]:
df_inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [197]:
df_lang.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [198]:
df_ren.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [199]:
df_old.head()

,first_name,last_name,title,release_year,category_id,film_id,complete_name,actor_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,PENELOPE GUINESS,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23,PENELOPE GUINESS,1
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25,PENELOPE GUINESS,1
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106,PENELOPE GUINESS,1
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140,PENELOPE GUINESS,1

In [200]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [201]:
df_lang.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [202]:
df_cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [203]:
df_inv.iloc[243]

inventory_id    244
film_id          55
store_id          1
Name: 243, dtype: int64

In [204]:
df_film.info('memory usage = deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 78.2+ KB

In [205]:
len(df_act.complete_name.value_counts())

199

In [206]:
len(df_old.complete_name.value_counts())

39

In [207]:
df_cat.head

<bound method NDFrame.head of     category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel>

In [208]:
max(df_old.category_id)

16

In [209]:
# EXPORTACION 
#df_act.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\actor_clean.csv', index=False)
#df_cat.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\category_clean.csv', index=False)
#df_film.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\film_clean.csv', index=False)
#df_inv.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\inventory_clean.csv', index=False)
#df_lang.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\language_clean.csv', index=False)
#df_old.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\old_HDD_clean.csv', index=False)
#df_ren.to_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean\rental_clean.csv', index=False)